Float.abs:
  short: absolute value
  description: >
    Calculates the absolute value of a number.
  return:
    type: 'Float'
    description: >
      The absolute value of `n`.
  args:
    n:
      type: 'Float'
      description: >
        The number whose absolute value is to be computed.
  example: |
    assert (-3.5).abs() == 3.5

Float.acos:
  short: arc cosine
  description: >
    Computes the arc cosine of a number.
  return:
    type: 'Float'
    description: >
      The arc cosine of `x` in radians.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the arc cosine is to be calculated.
  example: |
    assert (0.0).acos() == 1.5708

Float.acosh:
  short: arc hyperbolic cosine
  description: >
    Computes the inverse hyperbolic cosine of a number.
  return:
    type: 'Float'
    description: >
      The inverse hyperbolic cosine of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the inverse hyperbolic cosine is to be calculated.
  example: |
    assert (1.0).acosh() == 0

Float.asin:
  short: arc sine
  description: >
    Computes the arc sine of a number.
  return:
    type: 'Float'
    description: >
      The arc sine of `x` in radians.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the arc sine is to be calculated.
  example: |
    assert (0.5).asin() == 0.5236

Float.asinh:
  short: arc hyperbolic sine
  description: >
    Computes the inverse hyperbolic sine of a number.
  return:
    type: 'Float'
    description: >
      The inverse hyperbolic sine of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the inverse hyperbolic sine is to be calculated.
  example: |
    assert (0.0).asinh() == 0

Float.atan:
  short: arc tangent
  description: >
    Computes the arc tangent of a number.
  return:
    type: 'Float'
    description: >
      The arc tangent of `x` in radians.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the arc tangent is to be calculated.
  example: |
    assert (1.0).atan() == 0.7854

Float.atan2:
  short: arc tangent from 2 variables
  description: >
    Computes the arc tangent of the quotient of two numbers.
  return:
    type: 'Float'
    description: >
      The arc tangent of `x/y` in radians.
  args:
    x:
      type: 'Float'
      description: >
        The numerator.
    y:
      type: 'Float'
      description: >
        The denominator.
  example: |
    assert Float.atan2(1, 1) == 0.7854

Float.atanh:
  short: arc hyperbolic tangent.
  description: >
    Computes the inverse hyperbolic tangent of a number.
  return:
    type: 'Float'
    description: >
      The inverse hyperbolic tangent of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the inverse hyperbolic tangent is to be calculated.
  example: |
    assert (0.5).atanh() == 0.5493

Float.cbrt:
  short: cube root
  description: >
    Computes the cube root of a number.
  return:
    type: 'Float'
    description: >
      The cube root of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the cube root is to be calculated.
  example: |
    assert (27.0).cbrt() == 3

Float.ceil:
  short: ceiling function
  description: >
    Rounds a number up to the nearest integer.
  return:
    type: 'Float'
    description: >
      The smallest integer greater than or equal to `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number to be rounded up.
  example: |
    assert (3.2).ceil() == 4

Float.clamped:
  short: clamp a number
  description: >
    Returns the given number clamped between two values so that it is within
    that range.
  return:
    type: 'Float'
    description: >
      The first argument clamped between the other two arguments.
  args:
    x:
      type: 'Float'
      description: >
        The number to clamp.
    low:
      type: 'Float'
      description: >
        The lowest value the result can take.
    high:
      type: 'Float'
      description: >
        The highest value the result can take.
  example: |
    assert (2.5).clamped(5.5, 10.5) == 5.5

Float.copysign:
  short: copy a number's sign
  description: >
    Copies the sign of one number to another.
  return:
    type: 'Float'
    description: >
      A number with the magnitude of `x` and the sign of `y`.
  args:
    x:
      type: 'Float'
      description: >
        The number whose magnitude will be copied.
    y:
      type: 'Float'
      description: >
        The number whose sign will be copied.
  example: |
    assert (3.0).copysign(-1) == -3

Float.cos:
  short: cosine
  description: >
    Computes the cosine of a number (angle in radians).
  return:
    type: 'Float'
    description: >
      The cosine of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The angle in radians.
  example: |
    assert (0.0).cos() == 1

Float.cosh:
  short: hyperbolic cosine
  description: >
    Computes the hyperbolic cosine of a number.
  return:
    type: 'Float'
    description: >
      The hyperbolic cosine of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the hyperbolic cosine is to be calculated.
  example: |
    assert (0.0).cosh() == 1

Float.erf:
  short: error function
  description: >
    Computes the error function of a number.
  return:
    type: 'Float'
    description: >
      The error function of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the error function is to be calculated.
  example: |
    assert (0.0).erf() == 0

Float.erfc:
  short: complimentary error function
  description: >
    Computes the complementary error function of a number.
  return:
    type: 'Float'
    description: >
      The complementary error function of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the complementary error function is to be calculated.
  example: |
    assert (0.0).erfc() == 1

Float.exp:
  short: base-e exponentiation
  description: >
    Computes the exponential function $e^x$ for a number.
  return:
    type: 'Float'
    description: >
      The value of $e^x$.
  args:
    x:
      type: 'Float'
      description: >
        The exponent.
  example: |
    assert (1.0).exp() == 2.7183

Float.exp2:
  short: base-2 exponentiation
  description: >
    Computes $2^x$ for a number.
  return:
    type: 'Float'
    description: >
      The value of $2^x$.
  args:
    x:
      type: 'Float'
      description: >
        The exponent.
  example: |
    assert (3.0).exp2() == 8

Float.expm1:
  short: base-e exponential minus 1
  description: >
    Computes $e^x - 1$ for a number.
  return:
    type: 'Float'
    description: >
      The value of $e^x - 1$.
  args:
    x:
      type: 'Float'
      description: >
        The exponent.
  example: |
    assert (1.0).expm1() == 1.7183

Float.fdim:
  short: positive difference
  description: >
    Computes the positive difference between two numbers.
  return:
    type: 'Float'
    description: >
      The positive difference $\max(0, x - y)$.
  args:
    x:
      type: 'Float'
      description: >
        The first number.
    y:
      type: 'Float'
      description: >
        The second number.
  example: |
    fd

    assert (5.0).fdim(3) == 2

Float.floor:
  short: floor function
  description: >
    Rounds a number down to the nearest integer.
  return:
    type: 'Float'
    description: >
      The largest integer less than or equal to `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number to be rounded down.
  example: |
    assert (3.7).floor() == 3

Float.hypot:
  short: Euclidean distance function
  description: >
    Computes the Euclidean norm, $\sqrt{x^2 + y^2}$, of two numbers.
  return:
    type: 'Float'
    description: >
      The Euclidean norm of `x` and `y`.
  args:
    x:
      type: 'Float'
      description: >
        The first number.
    y:
      type: 'Float'
      description: >
        The second number.
  example: |
    assert Float.hypot(3, 4) == 5

Float.isfinite:
  short: check for finite number
  description: >
    Checks if a number is finite.
  return:
    type: 'Bool'
    description: >
      `yes` if `n` is finite, `no` otherwise.
  args:
    n:
      type: 'Float'
      description: >
        The number to be checked.
  example: |
    assert (1.0).isfinite() == yes
    assert Float.INF.isfinite() == no

Float.is_between:
  short: check if a number is in a range
  description: >
    Determines if a number is between two numbers (inclusive).
  return:
    type: 'Bool'
    description: >
      `yes` if `low <= x and x <= high`, otherwise `no`
  args:
    x:
      type: 'Float'
      description: >
        The integer to be checked.
    low:
      type: 'Float'
      description: >
        The lower bound to check (inclusive).
    high:
      type: 'Float'
      description: >
        The upper bound to check (inclusive).
  example: |
    assert (7.5).is_between(1, 10) == yes
    assert (7.5).is_between(100, 200) == no
    assert (7.5).is_between(1, 7.5) == yes

Float.isinf:
  short: check for infinite number
  description: >
    Checks if a number is infinite.
  return:
    type: 'Bool'
    description: >
      `yes` if `n` is infinite, `no` otherwise.
  args:
    n:
      type: 'Float'
      description: >
        The number to be checked.
  example: |
    assert Float.INF.isinf() == yes
    assert (1.0).isinf() == no

Float.j0:
  short: Bessel function
  description: >
    Computes the Bessel function of the first kind of order 0.
  return:
    type: 'Float'
    description: >
      The Bessel function of the first kind of order 0 of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the Bessel function is to be calculated.
  example: |
    assert (0.0).j0() == 1

Float.j1:
  short: Bessel function
  description: >
    Computes the Bessel function of the first kind of order 1.
  return:
    type: 'Float'
    description: >
      The Bessel function of the first kind of order 1 of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the Bessel function is to be calculated.
  example: |
    assert (0.0).j1() == 0

Float.log:
  short: natural logarithm
  description: >
    Computes the natural logarithm (base $e$) of a number.
  return:
    type: 'Float'
    description: >
      The natural logarithm of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the natural logarithm is to be calculated.
  example: |
    assert Float.E.log() == 1

Float.log10:
  short: logarithm base-10
  description: >
    Computes the base-10 logarithm of a number.
  return:
    type: 'Float'
    description: >
      The base-10 logarithm of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the base-10 logarithm is to be calculated.
  example: |
    assert (100.0).log10() == 2

Float.log1p:
  short: logarithm of 1 plus x
  description: >
    Computes $\log(1 + x)$ for a number.
  return:
    type: 'Float'
    description: >
      The value of $\log(1 + x)$.
  args:
    x:
      type: 'Float'
      description: >
        The number for which $\log(1 + x)$ is to be calculated.
  example: |
    assert (1.0).log1p() == 0.6931

Float.log2:
  short: logarithm base-2
  description: >
    Computes the base-2 logarithm of a number.
  return:
    type: 'Float'
    description: >
      The base-2 logarithm of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the base-2 logarithm is to be calculated.
  example: |
    assert (8.0).log2() == 3

Float.logb:
  short: exponent of a floating point value
  description: >
    Computes the binary exponent (base-2 logarithm) of a number.
  return:
    type: 'Float'
    description: >
      The binary exponent of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the binary exponent is to be calculated.
  example: |
    assert (8.0).logb() == 3

Float.mix:
  short: mix two numbers by an amount
  description: >
    Interpolates between two numbers based on a given amount.
  return:
    type: 'Float'
    description: >
      The interpolated number between `x` and `y` based on `amount`.
  args:
    amount:
      type: 'Float'
      description: >
        The interpolation factor (between `0` and `1`).
    x:
      type: 'Float'
      description: >
        The starting number.
    y:
      type: 'Float'
      description: >
        The ending number.
  example: |
    assert (0.5).mix(10, 20) == 15
    assert (0.25).mix(10, 20) == 12.5

Float.near:
  short: check if two numbers are near each other
  description: >
    Checks if two numbers are approximately equal within specified tolerances. If
    two numbers are within an absolute difference or the ratio between the two is
    small enough, they are considered near each other.
  return:
    type: 'Bool'
    description: >
      `yes` if `x` and `y` are approximately equal within the specified tolerances, `no` otherwise.
  args:
    x:
      type: 'Float'
      description: >
        The first number.
    y:
      type: 'Float'
      description: >
        The second number.
    ratio:
      type: 'Float'
      default: '1e-9'
      description: >
        The relative tolerance. Default is `1e-9`.
    min_epsilon:
      type: 'Float'
      default: '1e-9'
      description: >
        The absolute tolerance. Default is `1e-9`.
  example: |
    assert (1.0).near(1.000000001) == yes
    assert (100.0).near(110, ratio=0.1) == yes
    assert (5.0).near(5.1, min_epsilon=0.1) == yes

Float.nextafter:
  short: next floating point number
  description: >
    Computes the next representable value after a given number towards a specified direction.
  return:
    type: 'Float'
    description: >
      The next representable value after `x` in the direction of `y`.
  args:
    x:
      type: 'Float'
      description: >
        The starting number.
    y:
      type: 'Float'
      description: >
        The direction towards which to find the next representable value.
  example: |
    assert (1.0).nextafter(1.1) == 1.0000000000000002

Float.parse:
  short: convert text to number
  description: >
    Converts a text representation of a number into a floating-point number.
  return:
    type: 'Float?'
    description: >
      The number represented by the text or `none` if the entire text can't be parsed
      as a number.
  args:
    text:
      type: 'Text'
      description: >
        The text containing the number.
    remainder:
      type: '&Text?'
      default: 'none'
      description: >
        If non-none, this argument will be set to the remainder of the text after the matching part.
        If none, parsing will only succeed if the entire text matches.
  example: |
    assert Float.parse("3.14") == 3.14
    assert Float.parse("1e3") == 1000
    assert Float.parse("1.5junk") == none
    remainder : Text
    assert Float.parse("1.5junk", &remainder) == 1.5
    assert remainder == "junk"

Float.percent:
  short: format as a percentage
  description: >
    Convert a number into a percentage text with a percent sign.
  return:
    type: 'Text'
    description: >
      A text representation of the number as a percentage with a percent sign.
  args:
    n:
      type: 'Float'
      description: >
        The number to be converted to a percent.
    precision:
      type: 'Float'
      default: '0.01'
      description: >
        Round the percentage to this precision level.
  example: |
    assert (0.5).percent() == "50%"
    assert (1./3.).percent(2) == "33.33%"
    assert (1./3.).percent(2, precision=0.0001) == "33.3333%"
    assert (1./3.).percent(2, precision=10.) == "30%"

Float.with_precision:
  short: round to a given precision
  description: >
    Round a number to the given precision level (specified as `10`, `.1`, `.001` etc).
  return:
    type: 'Float'
    description: >
      The number, rounded to the given precision level.
  args:
    n:
      type: 'Float'
      description: >
        The number to be rounded to a given precision.
    precision:
      type: 'Float'
      description: >
        The precision to which the number should be rounded.
  example: |
    assert (0.1234567).with_precision(0.01) == 0.12
    assert (123456.).with_precision(100) == 123500
    assert (1234567.).with_precision(5) == 1234565

Float.rint:
  short: round to nearest integer
  description: >
    Rounds a number to the nearest integer, with ties rounded to the nearest even integer.
  return:
    type: 'Float'
    description: >
      The nearest integer value of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number to be rounded.
  example: |
    assert (3.5).rint() == 4
    assert (2.5).rint() == 2

Float.round:
  short: round to nearest integer
  description: >
    Rounds a number to the nearest whole number integer.
  return:
    type: 'Float'
    description: >
      The nearest integer value of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number to be rounded.
  example: |
    assert (2.3).round() == 2
    assert (2.7).round() == 3

Float.significand:
  short: get mantissa
  description: >
    Extracts the significand (or mantissa) of a number.
  return:
    type: 'Float'
    description: >
      The significand of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number from which to extract the significand.
  example: |
    assert (1234.567).significand() == 0.1234567

Float.sin:
  short: sine
  description: >
    Computes the sine of a number (angle in radians).
  return:
    type: 'Float'
    description: >
      The sine of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The angle in radians.
  example: |
    assert (0.0).sin() == 0

Float.sinh:
  short: hyperbolic sine
  description: >
    Computes the hyperbolic sine of a number.
  return:
    type: 'Float'
    description: >
      The hyperbolic sine of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the hyperbolic sine is to be calculated.
  example: |
    assert (0.0).sinh() == 0

Float.sqrt:
  short: square root
  description: >
    Computes the square root of a number.
  return:
    type: 'Float'
    description: >
      The square root of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the square root is to be calculated.
  example: |
    assert (16.0).sqrt() == 4

Float.tan:
  short: tangent
  description: >
    Computes the tangent of a number (angle in radians).
  return:
    type: 'Float'
    description: >
      The tangent of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The angle in radians.
  example: |
    assert (0.0).tan() == 0

Float.tanh:
  short: hyperbolic tangent
  description: >
    Computes the hyperbolic tangent of a number.
  return:
    type: 'Float'
    description: >
      The hyperbolic tangent of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the hyperbolic tangent is to be calculated.
  example: |
    assert (0.0).tanh() == 0

Float.tgamma:
  short: "true gamma function"
  description: >
    Computes the gamma function of a number.
  return:
    type: 'Float'
    description: >
      The gamma function of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the gamma function is to be calculated.
  example: |
    assert (1.0).tgamma() == 1

Float.trunc:
  short: truncate a number
  description: >
    Truncates a number to the nearest integer towards zero.
  return:
    type: 'Float'
    description: >
      The integer part of `x` towards zero.
  args:
    x:
      type: 'Float'
      description: >
        The number to be truncated.
  example: |
    assert (3.7).trunc() == 3
    assert (-3.7).trunc() == -3

Float.y0:
  short: Bessel function
  description: >
    Computes the Bessel function of the second kind of order 0.
  return:
    type: 'Float'
    description: >
      The Bessel function of the second kind of order 0 of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the Bessel function is to be calculated.
  example: |
    assert (1.0).y0() == -0.7652

Float.y1:
  short: Bessel function
  description: >
    Computes the Bessel function of the second kind of order 1.
  return:
    type: 'Float'
    description: >
      The Bessel function of the second kind of order 1 of `x`.
  args:
    x:
      type: 'Float'
      description: >
        The number for which the Bessel function is to be calculated.
  example: |
    assert (1.0).y1() == 0.4401


Float.1_PI:
  short: 1/pi
  type: Float
  description: >
    The constant $\frac{1}{\pi}$.
Float.2_PI:
  short: 2*pi
  type: Float
  description: >
    The constant $2 \times \pi$.
Float.2_SQRTPI:
  short: 2*sqrt(pi)
  type: Float
  description: >
    The constant $2 \times \sqrt{\pi}$.
Float.E:
  short: Euler's constant
  type: Float
  description: >
    The base of the natural logarithm ($e$).
Float.INF:
  short: infinity
  type: Float
  description: >
    Positive infinity.
Float.LN10:
  short: log(10)
  type: Float
  description: >
    The natural logarithm of 10.
Float.LN2:
  short: log(2)
  type: Float
  description: >
    The natural logarithm of 2.
Float.LOG2E:
  short: log_2(e)
  type: Float
  description: >
    The base 2 logarithm of $e$
Float.PI:
  short: pi
  type: Float
  description: >
    Pi ($\pi$).
Float.PI_2:
  short: pi/2
  type: Float
  description: >
    $\frac{\pi}{2}$
Float.PI_4:
  short: pi/4
  type: Float
  description: >
    $\frac{\pi}{4}$
Float.SQRT1_2:
  short: sqrt(1/2)
  type: Float
  description: >
    $\sqrt{\frac{1}{2}}$
Float.SQRT2:
  short: sqrt(2)
  type: Float
  description: >
    $\sqrt{2}$
Float.TAU:
  short: 2*pi
  type: Float
  description: >
    Tau ($2 \times \pi$)
